src/Documents/Запись/Запись.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Запись</name>
  <attributes>
    <name>Салон</name>
    <type>
      <types>CatalogRef.Фирма</types>
    </type>
  </attributes>
  <attributes>
    <name>сотрудники</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>клиент</name>
    <type>
      <types>CatalogRef.Клиент</types>
    </type>
  </attributes>
  <attributes>
    <name>услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Запись/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура услугаПриИзменении(Элемент)
	ИнфомацияОбУслуге	 =ПолучитьИнформациюОбУслуги(Объект.услуга, Объект.Дата);
	Объект.Длительность	 = ИнфомацияОбУслуге.Длительность;
	Объект.сумма				 = ИнфомацияОбУслуге.Цена;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьИнформациюОбУслуги(Услуга, Дата)
	
	Результат = Новый Структура("Длительность , Цена",  0, 0);

//	Запрос = Новый Запрос;
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена,
//		|	Услуги.Длительность КАК Длительность
//		|ИЗ
//		|	Справочник.Услуги КАК Услуги
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&Дата, Услуга = &Услуга) КАК ЦеныСрезПоследних
//		|		ПО Услуги.Ссылка = ЦеныСрезПоследних.Услуга
//		|ГДЕ
//		|	Услуги.Ссылка = &Услуга";
//	
//	Запрос.УстановитьПараметр("Услуга", Услуга);
//	Запрос.УстановитьПараметр("Дата", Дата);


Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена,
	|	Услуги.Длительность
	|ИЗ
	|	Справочник.Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&Дата, Услуга = &Услуга) КАК ЦеныСрезПоследних
	|		ПО Услуги.Ссылка = ЦеныСрезПоследних.Услуга
	|ГДЕ
	|	Услуги.Ссылка = &Услуга";

Запрос.УстановитьПараметр("Услуга", Услуга);
Запрос.УстановитьПараметр("Дата", Дата);


	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
	КонецЕсли;
		
	Возврат Результат;	
КонецФункции
